0xsmirk/mcu_cmsis_svd/Spansion/MB9BF52xS.svd
        <!-- REGISTER "IRQ15MON" -->
        <register>
          <name>IRQ15MON</name>
          <description> register IRQ15MON </description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSINT1" -->
            <field>
              <name>MFSINT1</name>
              <description> bitfield MFSINT1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MFSINT0" -->
            <field>
              <name>MFSINT0</name>
              <description> bitfield MFSINT0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ16MON" -->
        <register>
          <name>IRQ16MON</name>
          <description> register IRQ16MON </description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSINT3" -->
            <field>
              <name>MFSINT3</name>
              <description> bitfield MFSINT3 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MFSINT2" -->
            <field>
              <name>MFSINT2</name>
              <description> bitfield MFSINT2 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MFSINT1" -->
            <field>
              <name>MFSINT1</name>
              <description> bitfield MFSINT1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MFSINT0" -->
            <field>
              <name>MFSINT0</name>
              <description> bitfield MFSINT0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ17MON" -->
        <register>
          <name>IRQ17MON</name>
          <description> register IRQ17MON </description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSINT1" -->
            <field>
              <name>MFSINT1</name>
              <description> bitfield MFSINT1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MFSINT0" -->
            <field>
              <name>MFSINT0</name>
              <description> bitfield MFSINT0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ18MON" -->
        <register>
          <name>IRQ18MON</name>
          <description> register IRQ18MON </description>
          <addressOffset>0x5C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSINT3" -->
            <field>
              <name>MFSINT3</name>
              <description> bitfield MFSINT3 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MFSINT2" -->
            <field>
              <name>MFSINT2</name>
              <description> bitfield MFSINT2 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MFSINT1" -->
            <field>
              <name>MFSINT1</name>
              <description> bitfield MFSINT1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MFSINT0" -->
            <field>
              <name>MFSINT0</name>
              <description> bitfield MFSINT0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ19MON" -->
        <register>
          <name>IRQ19MON</name>
          <description> register IRQ19MON </description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSINT1" -->
            <field>
              <name>MFSINT1</name>
              <description> bitfield MFSINT1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MFSINT0" -->
            <field>
              <name>MFSINT0</name>
              <description> bitfield MFSINT0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ20MON" -->
        <register>
          <name>IRQ20MON</name>
          <description> register IRQ20MON </description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSINT3" -->
            <field>
              <name>MFSINT3</name>
              <description> bitfield MFSINT3 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MFSINT2" -->
            <field>
              <name>MFSINT2</name>
              <description> bitfield MFSINT2 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MFSINT1" -->
            <field>
              <name>MFSINT1</name>
              <description> bitfield MFSINT1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MFSINT0" -->
            <field>
              <name>MFSINT0</name>
              <description> bitfield MFSINT0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ21MON" -->
        <register>
          <name>IRQ21MON</name>
          <description> register IRQ21MON </description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSINT1" -->
            <field>
              <name>MFSINT1</name>
              <description> bitfield MFSINT1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MFSINT0" -->
            <field>
              <name>MFSINT0</name>
              <description> bitfield MFSINT0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ22MON" -->
        <register>
          <name>IRQ22MON</name>
          <description> register IRQ22MON </description>
          <addressOffset>0x6C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSINT3" -->
            <field>
              <name>MFSINT3</name>
              <description> bitfield MFSINT3 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MFSINT2" -->
            <field>
              <name>MFSINT2</name>
              <description> bitfield MFSINT2 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MFSINT1" -->
            <field>
              <name>MFSINT1</name>
              <description> bitfield MFSINT1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MFSINT0" -->
            <field>
              <name>MFSINT0</name>
              <description> bitfield MFSINT0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ23MON" -->
        <register>
          <name>IRQ23MON</name>
          <description> register IRQ23MON </description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x07</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PPGINT2" -->
            <field>
              <name>PPGINT2</name>
              <description> bitfield PPGINT2 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "PPGINT1" -->
            <field>
              <name>PPGINT1</name>
              <description> bitfield PPGINT1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "PPGINT0" -->
            <field>
              <name>PPGINT0</name>
              <description> bitfield PPGINT0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
