0xsmirk/mcu_cmsis_svd/Spansion/MB9BF52xS.svd
        <!-- REGISTER "SPSR" -->
        <register>
          <name>SPSR</name>
          <description> register SPSR </description>
          <addressOffset>0x580</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x05</resetValue>
          <resetMask>0x1F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "USB0C" -->
            <field>
              <name>USB0C</name>
              <description> bitfield USB0C </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MAINXC" -->
            <field>
              <name>MAINXC</name>
              <description> bitfield MAINXC </description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SUBXC" -->
            <field>
              <name>SUBXC</name>
              <description> bitfield SUBXC </description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EPFR00" -->
        <register>
          <name>EPFR00</name>
          <description> register EPFR00 </description>
          <addressOffset>0x600</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0030000</resetValue>
          <resetMask>0x303002F7</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TRC1E" -->
            <field>
              <name>TRC1E</name>
              <description> bitfield TRC1E </description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TRC0E" -->
            <field>
              <name>TRC0E</name>
              <description> bitfield TRC0E </description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "JTAGEN1S" -->
            <field>
              <name>JTAGEN1S</name>
              <description> bitfield JTAGEN1S </description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "JTAGEN0B" -->
            <field>
              <name>JTAGEN0B</name>
              <description> bitfield JTAGEN0B </description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "USBP0E" -->
            <field>
              <name>USBP0E</name>
              <description> bitfield USBP0E </description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SUBOUTE" -->
            <field>
              <name>SUBOUTE</name>
              <description> bitfield SUBOUTE </description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RTCCOE" -->
            <field>
              <name>RTCCOE</name>
              <description> bitfield RTCCOE </description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CROUTE" -->
            <field>
              <name>CROUTE</name>
              <description> bitfield CROUTE </description>
              <lsb>1</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "NMIS" -->
            <field>
              <name>NMIS</name>
              <description> bitfield NMIS </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EPFR01" -->
        <register>
          <name>EPFR01</name>
          <description> register EPFR01 </description>
          <addressOffset>0x604</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFF1FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "IC03S" -->
            <field>
              <name>IC03S</name>
              <description> bitfield IC03S </description>
              <lsb>29</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "IC02S" -->
            <field>
              <name>IC02S</name>
              <description> bitfield IC02S </description>
              <lsb>26</lsb>
              <msb>28</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "IC01S" -->
            <field>
              <name>IC01S</name>
              <description> bitfield IC01S </description>
              <lsb>23</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "IC00S" -->
            <field>
              <name>IC00S</name>
              <description> bitfield IC00S </description>
              <lsb>20</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FRCK0S" -->
            <field>
              <name>FRCK0S</name>
              <description> bitfield FRCK0S </description>
              <lsb>18</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DTTI0S" -->
            <field>
              <name>DTTI0S</name>
              <description> bitfield DTTI0S </description>
              <lsb>16</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DTTI0C" -->
            <field>
              <name>DTTI0C</name>
              <description> bitfield DTTI0C </description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RTO05E" -->
            <field>
              <name>RTO05E</name>
              <description> bitfield RTO05E </description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RTO04E" -->
            <field>
              <name>RTO04E</name>
              <description> bitfield RTO04E </description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RTO03E" -->
            <field>
              <name>RTO03E</name>
              <description> bitfield RTO03E </description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RTO02E" -->
            <field>
              <name>RTO02E</name>
              <description> bitfield RTO02E </description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RTO01E" -->
            <field>
              <name>RTO01E</name>
              <description> bitfield RTO01E </description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RTO00E" -->
            <field>
              <name>RTO00E</name>
              <description> bitfield RTO00E </description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EPFR02" -->
        <register>
          <name>EPFR02</name>
          <description> register EPFR02 </description>
          <addressOffset>0x608</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
        </register>
        <!-- REGISTER "EPFR03" -->
        <register>
          <name>EPFR03</name>
          <description> register EPFR03 </description>
          <addressOffset>0x60C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
        </register>
        <!-- REGISTER "EPFR04" -->
        <register>
          <name>EPFR04</name>
          <description> register EPFR04 </description>
          <addressOffset>0x610</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3F3C3F7C</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TIOB3S" -->
            <field>
              <name>TIOB3S</name>
              <description> bitfield TIOB3S </description>
              <lsb>28</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA3E" -->
            <field>
              <name>TIOA3E</name>
              <description> bitfield TIOA3E </description>
              <lsb>26</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA3S" -->
            <field>
              <name>TIOA3S</name>
              <description> bitfield TIOA3S </description>
              <lsb>24</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOB2S" -->
            <field>
              <name>TIOB2S</name>
              <description> bitfield TIOB2S </description>
              <lsb>20</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA2E" -->
            <field>
              <name>TIOA2E</name>
              <description> bitfield TIOA2E </description>
              <lsb>18</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOB1S" -->
            <field>
              <name>TIOB1S</name>
              <description> bitfield TIOB1S </description>
              <lsb>12</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA1E" -->
            <field>
              <name>TIOA1E</name>
              <description> bitfield TIOA1E </description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA1S" -->
            <field>
              <name>TIOA1S</name>
              <description> bitfield TIOA1S </description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOB0S" -->
            <field>
              <name>TIOB0S</name>
              <description> bitfield TIOB0S </description>
              <lsb>4</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA0E" -->
            <field>
              <name>TIOA0E</name>
              <description> bitfield TIOA0E </description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EPFR05" -->
        <register>
          <name>EPFR05</name>
          <description> register EPFR05 </description>
          <addressOffset>0x614</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3F3C3F3C</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TIOB7S" -->
            <field>
              <name>TIOB7S</name>
              <description> bitfield TIOB7S </description>
              <lsb>28</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA7E" -->
            <field>
              <name>TIOA7E</name>
              <description> bitfield TIOA7E </description>
              <lsb>26</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA7S" -->
            <field>
              <name>TIOA7S</name>
              <description> bitfield TIOA7S </description>
              <lsb>24</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOB6S" -->
            <field>
              <name>TIOB6S</name>
              <description> bitfield TIOB6S </description>
              <lsb>20</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA6E" -->
            <field>
              <name>TIOA6E</name>
              <description> bitfield TIOA6E </description>
              <lsb>18</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOB5S" -->
            <field>
              <name>TIOB5S</name>
              <description> bitfield TIOB5S </description>
              <lsb>12</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA5E" -->
            <field>
              <name>TIOA5E</name>
              <description> bitfield TIOA5E </description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA5S" -->
            <field>
              <name>TIOA5S</name>
              <description> bitfield TIOA5S </description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOB4S" -->
            <field>
              <name>TIOB4S</name>
              <description> bitfield TIOB4S </description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA4E" -->
            <field>
              <name>TIOA4E</name>
              <description> bitfield TIOA4E </description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
