0xsmirk/mcu_cmsis_svd/Spansion/MB9BF52xS.svd
        <!-- REGISTER "INTR" -->
        <register>
          <name>INTR</name>
          <description> register INTR </description>
          <addressOffset>0x8</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "INTID" -->
            <field>
              <name>INTID</name>
              <description> bitfield INTID </description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TESTR" -->
        <register>
          <name>TESTR</name>
          <description> register TESTR </description>
          <addressOffset>0xA</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x00F4</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RX" -->
            <field>
              <name>RX</name>
              <description> bitfield RX </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TX" -->
            <field>
              <name>TX</name>
              <description> bitfield TX </description>
              <lsb>5</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LBACK" -->
            <field>
              <name>LBACK</name>
              <description> bitfield LBACK </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SILENT" -->
            <field>
              <name>SILENT</name>
              <description> bitfield SILENT </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BASIC" -->
            <field>
              <name>BASIC</name>
              <description> bitfield BASIC </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "BRPER" -->
        <register>
          <name>BRPER</name>
          <description> register BRPER </description>
          <addressOffset>0xC</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x000F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BRPE" -->
            <field>
              <name>BRPE</name>
              <description> bitfield BRPE </description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IF1CREQ" -->
        <register>
          <name>IF1CREQ</name>
          <description> register IF1CREQ </description>
          <addressOffset>0x10</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0001</resetValue>
          <resetMask>0x80FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BUSY" -->
            <field>
              <name>BUSY</name>
              <description> bitfield BUSY </description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MESSAGENUMBER" -->
            <field>
              <name>MESSAGENUMBER</name>
              <description> bitfield MESSAGENUMBER </description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IF1CMSK" -->
        <register>
          <name>IF1CMSK</name>
          <description> register IF1CMSK </description>
          <addressOffset>0x12</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x00FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WRRD" -->
            <field>
              <name>WRRD</name>
              <description> bitfield WRRD </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MASK" -->
            <field>
              <name>MASK</name>
              <description> bitfield MASK </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ARB" -->
            <field>
              <name>ARB</name>
              <description> bitfield ARB </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CONTROL" -->
            <field>
              <name>CONTROL</name>
              <description> bitfield CONTROL </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CIP" -->
            <field>
              <name>CIP</name>
              <description> bitfield CIP </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "NEWDAT" -->
            <field>
              <name>NEWDAT</name>
              <description> bitfield NEWDAT </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DATAA" -->
            <field>
              <name>DATAA</name>
              <description> bitfield DATAA </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DATAB" -->
            <field>
              <name>DATAB</name>
              <description> bitfield DATAB </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
